/**
 * Задача 1.2.1.2.с
 * Составьте программу, которая принимает с клавиатуры целое число и, 
 * если оно равно нулю, выводит на экран сообщение "ноль". 
 * 
 * Например: ввод: 0 ⇒ вывод: ноль
 */
#include <stdio.h>

int main(){
    int gg;
    scanf("%d", &gg);
    if (gg = 0){
        printf("zero");
    }
    

    return 0;
}