/**
 * 1.2.1.7
 * Составьте программу, которая принимает с клавиатуры три значения (а, b и с), 
 * являющиеся коэффициентами квадратного уравнения.  
 * Программа должна определить, имеется ли у этого уравнения хотя бы один корень (решение), 
 * и вывести на экран соответствующее текстовое сообщение. 
 * 
 * Например: ввод: 1, 8, 2 ⇒ вывод: уравнение имеет решение; 
 * ввод: 7, 3, 6 ⇒ вывод: уравнение не имеет решения
 */
#include <stdio.h>

int int main() {
    int a;
    int b;
    int c;
    scanf("%d%d%d", &a, &b, &c);

    return 0;
}